    let currentFilter = 'all';
    let map;
    let activeMarkers = []; 
    let epicenterMarkers = []; 
    let focusBadgeMarkers = []; 
    let jmaIntensityMarkers = []; 
    let lastLatestEqId = null;
    let lastGlobalLatestEqId = null; 
    
    let isSoundEnabled = false;
    const alertSound = new Audio('https://assets.mixkit.co/active_storage/sfx/2574/2574-preview.mp3');
    let isMarkersVisible = true;
    const bounds = {
        all: { center: [25.0, 130.0], zoom: 3 },
        korea: { minLat: 32.0, maxLat: 43.0, minLng: 124.0, maxLng: 132.0, center: [36.5, 128.0], zoom: 6 },
        emsc: { center: [48.0, 15.0], zoom: 4 },
        japan: { center: [36.0, 138.0], zoom: 5 },
        usgs: { center: [38.0, -97.0], zoom: 4 },
        ingv: { center: [41.9, 12.5], zoom: 5 },
        usp: { center: [-14.0, -51.0], zoom: 4 }, // 브라질 USP 바운드 추가
        geonet: { center: [-41.0, 174.0], zoom: 5 },
        gfz: { center: [51.0, 10.0], zoom: 4 },
        ga: { center: [-25.0, 134.0], zoom: 4 },
        bgs: { center: [54.5, -3.0], zoom: 5 }
    };

    const prefCoords = {
        "北海道": [43.06, 141.34], "青森県": [40.82, 140.74], "岩手県": [39.70, 141.15], "宮城県": [38.26, 140.86],
        "秋田県": [39.71, 140.10], "山形県": [38.24, 140.36], "福島県": [37.75, 140.46], "茨城県": [36.34, 140.44],
        "栃木県": [36.56, 139.88], "群馬県": [36.39, 139.06], "埼玉県": [35.85, 139.64], "千葉県": [35.60, 140.12],
        "東京都": [35.68, 139.69], "神奈川県": [35.44, 139.64], "新潟県": [37.90, 139.02], "富山県": [36.69, 137.21],
        "石川県": [36.59, 136.62], "福井県": [36.06, 136.22], "山梨県": [35.66, 138.56], "長野県": [36.65, 138.18],
        "岐阜県": [35.39, 136.72], "静岡県": [34.97, 138.38], "愛知県": [35.18, 136.90], "三重県": [34.73, 136.50],
        "滋賀県": [35.00, 135.86], "京都府": [35.02, 135.75], "大阪府": [34.68, 135.52], "兵庫県": [34.69, 135.18],
        "奈良県": [34.68, 135.80], "和歌山県": [34.22, 135.16], "鳥取県": [35.50, 134.23], "島根県": [35.47, 133.05],
        "岡山県": [34.66, 133.93], "広島県": [34.39, 132.46], "山口県": [34.18, 131.47], "徳島県": [34.06, 134.55],
        "香川県": [34.34, 134.04], "愛媛県": [33.84, 132.76], "高知県": [33.56, 133.53], "福岡県": [33.60, 130.41],
        "佐賀県": [33.26, 130.30], "長崎県": [32.74, 129.87], "熊本県": [32.79, 130.74], "大分県": [33.23, 131.61],
        "宮崎県": [31.91, 131.42], "鹿児島県": [31.56, 130.55], "沖縄県": [26.21, 127.68]
    };
